app/controllers/home_controller.rb

SELECT COUNT(*) FROM "recipes"
---
  def index
 @number_of_recipes = Recipe.count