app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE (lower(title) like '%%'
---
  def index
    if params[:q]
    @recipes = Recipe.find_all_by_query(params[:q])
    else
    @recipes = Recipe.all

SELECT "categories".* FROM "categories"
---
    def new
     @recipe = Recipe.new
     @categories = Category.all.collect{|c| [c.name, c.id] }

INSERT INTO "recipes" ("title", "ingredients", "instructions", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dsadf"], ["ingredients", "asdfsadf"], ["instructions", "asdfsadf"], ["category_id", 1], ["created_at", "2017-10-17 04:59:19.786154"], ["updated_at", "2017-10-17 04:59:19.786154"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "ingredients" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["ingredients", "Wonton wraps,\r\nCream Chesse,\r\nFrying oil"], ["updated_at", "2017-10-09 21:38:40.082266"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_recipe
     @recipe = Recipe.includes(:category).find(params[:id])